app/controllers/attendances_controller.rb

SELECT  "attendances".* FROM "attendances" ORDER BY "attendances"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
def new
    @attendances = Attendance.last

INSERT INTO "attendances" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_EWa673Tvh0Z09q"], ["user_id", 1], ["event_id", 5], ["created_at", "2019-02-13 23:14:49.932319"], ["updated_at", "2019-02-13 23:14:49.932319"]]
---
def create

        @attendance = Attendance.new
        @attendance.stripe_customer_id = $customer.id
        @attendance.event_id = $id_event.id
        @attendance.user_id = current_user.id



        if @attendance.save # essaie de sauvegarder en base @gossip