app/controllers/charges_controller.rb

    def new
    #@event_id = Event.find($event_id)

    $id_event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]