app/controllers/events_controller.rb

    def show
        @id_event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def new
    @event = Event.last
---
SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 1]]

    def create
        @event = Event.new
        @event.title = params['event_title']
        @event.start_date = params['event_date']
        @event.duration = params['event_duration']
        @event.price = params['event_price']
        @event.location = params['event_location']
        @event.description = params['event_description']
        @event.admin_id = current_user.id

        if @event.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"