app/controllers/users_controller.rb

    def show
        #@id_user = User.find(current_user.id)
        @id_user = User.find(params[:id])
        if user_signed_in?
        @event = Event.where("admin_id = ?", current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE (admin_id = 1)